// 输出二维数组的地址和值

# include<stdio.h>
int main()
{
	int a[3][4] = {{1,3,5,7},{9,11,13,15},{17,19,21,23}};
	
	printf("%p,%p\n", a, *a);                 // 0行首地址 和 0行0列元素地址
	printf("%p,%p\n", a[0], *(a+0));          // 0行0列元素地址

	printf("%p,%p\n", &a[1][0], *(a+1)+0);    // 1行0列元素地址
	printf("%p,%p\n", &a[2], *(a+2));         // 2行0列元素地址

	printf("%d,%d\n", a[1][0], *(*(a+1)+0));  // 1行0列元素
	printf("%d,%d\n", *a[2], *(*(a+2)+0));    // 2行0列元素

    printf("%d, %p\n", a[2][3], &a[2][3]);  //  2行3列元素 和地址

	return 0;
}
